{
  "slug": "builder-system-mobile",
  "mode": "json-for-shortcut",
  "files": [
    {
      "path": "spec/requirements.yaml",
      "content": "project:\n  name: Builder System Mobile\n  slug: builder-system-mobile\n  branch: app\n  targets: [\"ios_app\"]\n  app_kind: personal\n  lane: standard\nobjectives:\n  - Connect to an existing or new Claude Code / CodeX tmux session from iOS.\n  - Provide a mobile-friendly big-text terminal view larger than Termius.\n  - Enable Whisper dictation (press-and-hold) to send commands.\n  - Enable TTS to read back the last visible output block.\n  - Allow creation of new sessions with presets for Claude Code / CodeX and optional custom commands.\n  - Push notifications for \"needs approval\" with optional run failed / run finished.\n  - Theme follows system Light/Dark Mode.\nconstraints:\n  budget_tokens: 0\n  runtime_envs: [\"iOS\", \"tmux\", \"SSH\"]\n  secrets: [\"SSH_PRIVATE_KEY\", \"APNS_AUTH_KEY\"]\ninputs:\n  data_sources: []\noutputs:\n  deliverables:\n    - iOS application package\n    - SSH/tmux connection logic\n    - Whisper dictation integration\n    - TTS playback integration\n    - Push notification integration\n    - Session creation/attachment UI\n    - Light/Dark Mode support\ndefinition_of_done:\n  - App connects/attaches or creates tmux sessions in ≤3s.\n  - Terminal text larger than standard SSH apps; adjustable via pinch-to-zoom or settings.\n  - Whisper → input → send to session; visible in terminal output.\n  - TTS plays last visible output block on demand.\n  - Push notifications arrive for \"needs approval\" and deep-link into the session.\n  - Light/Dark theme automatically follows system settings.\nnotes:\n  risks:\n    - Push setup requires Apple Developer push configuration and a small server notifier helper.\n  assumptions:\n    - User has existing Claude Code / CodeX CLI sessions available on server.\n    - User can install a lightweight notifier helper on the server for APNs.\n\nhandoff:\n  base_path: \"~/Documents/Builder/capsules/builder-system-mobile/\"\ndependencies: []"
    },
    {
      "path": "spec/system.md",
      "content": "# Builder System Mobile — System Overview\n\n## Purpose\nBuilder System Mobile is an iOS application designed for real-time interaction with existing Claude Code and CodeX CLI agents running on a user's server. It provides a large-text, mobile-friendly terminal interface with voice input and output capabilities, plus push notifications for critical agent events.\n\n## Core Components\n\n### iOS App\n- Terminal View: Large, readable mono font; pinch-to-zoom for size adjustment; follow-tail and pause modes.\n- Voice Input: Press-and-hold Whisper dictation to send commands to the active session.\n- Voice Output: TTS playback of the last visible output block.\n- Session Management: Attach to existing tmux sessions or create new ones using presets (Claude Code / CodeX) or custom commands.\n- Push Notifications: Receives APNs for key events (needs approval, optional failed/finished) and deep-links into the relevant session.\n- Theme: Follows system Light/Dark Mode settings.\n\n### Server-Side\n- Direct SSH Connection: App connects to server via SSH into tmux sessions.\n- Notifier Helper: Lightweight service or script to send APNs via Apple token-based authentication when triggered by agent output or events.\n\n## Data Flow\n1. Connection: User selects or creates a session; app connects over SSH to tmux.\n2. Terminal Streaming: Output streamed to the app with ANSI color handling.\n3. User Input: Dictation captured via Whisper, converted to text, and sent over SSH.\n4. Voice Output: Last block of terminal output sent to iOS TTS for playback.\n5. Push Events: Server helper detects relevant events, sends APNs to the app.\n\n## Constraints\n- Foreground streaming only; no persistent background connection.\n- No strict visual guardrails beyond readability and theme compliance.\n\n## Future Enhancements (post-MVP)\n- Structured event protocol and prompt cards.\n- Multi-device sync and offline cache.\n- Additional notification types and richer deep-link contexts."
    },
    {
      "path": "spec/test_plan.md",
      "content": "# Builder System Mobile — Test Plan\n\n## Goals\nEnsure Builder System Mobile meets the MVP requirements for connectivity, usability, and notification functionality.\n\n## Test Areas\n\n### 1. Connection & Session Management\n- Connect Existing Session: Verify app connects to an existing tmux session in ≤3s.\n- Create New Session:\n  - Claude Code preset: launches correct command.\n  - CodeX preset: launches correct command.\n  - Custom command executes as entered.\n- Error Handling: Test connection failure, auth failure, and session name conflict.\n\n### 2. Terminal UI\n- Readability: Font size adjustable via pinch-to-zoom; persists between sessions.\n- Follow Tail: New output auto-scrolls; pause disables scrolling.\n- ANSI Handling: Colors and formatting display correctly.\n\n### 3. Voice Input (Whisper)\n- Mic Control: Press-and-hold captures dictation; releasing sends to session.\n- Accuracy: Command appears as transcribed and executes.\n- Error States: Handle microphone permission denial.\n\n### 4. Voice Output (TTS)\n- Playback: Last visible block read back clearly.\n- Interrupt: Stopping playback mid-way works without errors.\n\n### 5. Push Notifications\n- Needs Approval: Notification appears and deep-links into the correct session.\n- Optional Events: Run failed and run finished (if enabled) notify correctly.\n- No Duplicates: Same event does not produce repeated pushes.\n\n### 6. Theme\n- Light/Dark Mode: App follows system setting; verify switch at runtime.\n\n## Non-Functional\n- Performance: Terminal updates in near real-time with minimal latency.\n- Stability: App handles network drops gracefully and reconnects quickly.\n- Security: SSH key authentication functions correctly; APNs tokens secured.\n\n## Acceptance Criteria\nAll DoD items in requirements.yaml are met and verified through functional and non-functional testing."
    },
    {
      "path": "spec/context.jsonl",
      "content": "{\"nugget\": \"App connects to existing or new tmux session running Claude Code / CodeX on server via SSH.\"}\n{\"nugget\": \"Terminal UI is mobile-friendly with large readable text and pinch-to-zoom adjustment.\"}\n{\"nugget\": \"Voice input via Whisper dictation; press-and-hold to capture command and send to session.\"}\n{\"nugget\": \"Voice output via TTS plays last visible block of terminal output.\"}\n{\"nugget\": \"Create new sessions from iOS with presets for Claude Code and CodeX, plus custom command option.\"}\n{\"nugget\": \"Push notifications for 'needs approval' and optional run failed/run finished events.\"}\n{\"nugget\": \"Theme follows system Light/Dark mode.\"}\n{\"nugget\": \"Direct SSH + tmux architecture; foreground streaming only.\"}\n{\"nugget\": \"Lightweight server helper sends APNs when agent output triggers event.\"}"
    }
  ]
}